# Названия валют
CURRENCY_COINS = "Монеты"
CURRENCY_DIAMONDS = "Звезды"

# Токен бота
BOT_TOKEN = 'YOU TOKEN'  # Замените на ваш токен 

# Эмодзи для валют (если нужно)
EMOJI_COINS = "💰"
EMOJI_DIAMONDS = "⭐"

# ID сервера
GUILD_ID = 1234567  # Замените на ID вашего сервера 

# Коэффициент конвертации (сколько монет дается за 1 звезду)
CONVERSION_RATE = 200 

# Время ожидания для дуэли (в секундах)
DUEL_TIMEOUT = 30 

# Комиссия на переводы (в процентах)
TRANSFER_FEE = 5  # 5% комиссия 

# Время ожидания для кнопок (в секундах)
BUTTON_TIMEOUT = 60 

# Цены за управление ролями
ROLE_CREATE_PRICE = 5000  # Цена за создание роли
ROLE_COLOR_PRICE = 1500   # Цена за смену цвета
ROLE_NAME_PRICE = 3000    # Цена за смену названия 

# Настройки приватных комнат
PRIVATE_CATEGORY_ID = 1234567  # ID категории для приватных комнат 

# Цены за управление приватными комнатами
ROOM_RENAME_PRICE = 500    # Цена за смену названия комнаты
ROOM_COLOR_PRICE = 1000    # Цена за смену цвета роли 

# Каналы для логов
LOG_CHANNEL_ID = 1234567  # Замените на ID вашего канала для логов 

# Каналы для логов
TRANSFER_LOG_CHANNEL_ID = 1234567  # ID канала для логов переводов
ROOM_LOG_CHANNEL_ID = 1234567      # ID канала для логов личных комнат 
LOVE_LOG_CHANNEL_ID = 1234567      # ID канала для логов любовных комнат

# Настройки любовных комнат
LOVE_CATEGORY_ID = 1234567     # ID категории для любовных комнат
LOVE_VOICE_TRANSFER_ID = 1234567  # ID войс переводника (должен быть другой ID)
LOVE_ROLE_ID = 1234567  # ID роли для женатых/замужних
MARRY_PRICE = 1234567  # Цена за брак в монетах 

# Пути к файлам для профиля
PROFILE_TEMPLATE_PATH = "assets/profile.png"  # Путь к шаблону профиля
PROFILE_FONT_PATH = "assets/font.ttf"         # Путь к шрифту 
